"""所以建模需要的卡池都放在这里了"""
# 明日方舟卡池
# 0和重复的元素只是为了控制概率
import json as js
test = {
    'description': '无',
    'six_up': ['Aup', 0],
    'five_up': ['Bup', 0],
    'six_stars': ['A1', 'A2', 'A3'],
    'five_stars': ['B1', 'B2', 'B3'],
    'four_stars': ['C1', 'C2', 'C3', 'C4'],
    'three_stars': ['D1', 'D2', 'D3', 'D4', 'D5'],
}
# 池子
test2 = {
    'description': '这个池子没有up！',
    'six_up': [0],
    'five_up': [0],
    'six_stars': ['能天使', '黑', '安洁莉娜', '银灰', '莫斯提马', '夜莺', '星熊', '陈',
                  '阿', '煌', '麦哲伦', '赫拉格', '斯卡蒂', '塞雷娅', '闪灵', '艾雅法拉', '伊芙利特',
                  '推进之王', '刻俄柏', '风笛', '傀影', '温蒂', '早露', '铃兰', '棘刺', '森蚺',
                  '史尔特尔', '瑕光', '泥岩', '山', '空弦', '嵯峨', '异客', '凯尔希', '夕', '年',
                  'W', '迷迭香', '浊心斯卡蒂'],
    'five_stars': ['狮蝎', '食铁兽', '蓝毒', '拉普兰德', '幽灵鲨', '德克萨斯', '槐琥',
                   '赫默', '红', '白面鸮', '空', '吽', '灰喉', '布洛卡', '苇草', '送葬人', '星极',
                   '格劳克斯', '诗怀雅', '夜魔', '真理', '初雪', '崖心', '守林人', '普罗旺斯', '可颂',
                   '雷蛇', '临光', '华法琳', '梅尔', '天火', '陨星', '白金', '芙兰卡', '凛冬', '惊蛰',
                   '慑砂', '巫恋', '极境', '石棉', '月禾', '莱恩哈特', '断崖', '蜜蜡', '贾维', '安哲拉',
                   '燧石', '四月', '奥斯塔', '絮雨', '卡夫卡', '爱丽丝', '乌有', '熔泉', '赤冬'],
    'four_stars': ['安比尔', '梅', '红云', '桃金娘', '苏苏洛', '格雷伊', '猎蜂', '阿消',
                   '地灵', '深海色', '古米', '蛇屠箱', '角峰', '调香师', '末药', '暗索', '砾', '慕斯',
                   '霜叶', '缠丸', '杜宾', '红豆', '清道夫', '白雪', '流星', '杰西卡', '远山', '夜烟',
                   '宴', '刻刀', '波登可', '卡达', '孑', '酸糖', '芳汀', '泡泡', '杰克', '松果', '豆苗'],
    'three_stars': ['芬', '炎熔', '月见夜', '香草', '史都华德', '卡缇', '米格鲁', '斑点',
                    '空爆', '梓兰', '芙蓉', '克洛丝', '玫兰莎', '翎羽', '泡普卡', '安赛尔'],
}
# '浊心斯卡蒂'和'凯尔希'占六星出率的70%，'W'在剩余出率中以5倍权值出率提升
#  '赤冬'占五星出率的50%
shengdao = {
    'description': "'浊心斯卡蒂'和'凯尔希'占六星出率的70%，" +
                   "'W'在剩余出率中以5倍权值出率提升;\n" +
                   "'赤冬'占五星出率的50%",
    'six_up': ['浊心斯卡蒂', '凯尔希', '浊心斯卡蒂', '凯尔希', '浊心斯卡蒂', '凯尔希',
               '浊心斯卡蒂', '凯尔希', '浊心斯卡蒂', '凯尔希', '浊心斯卡蒂', '凯尔希',
               '浊心斯卡蒂', '凯尔希',
               0, 0, 0, 0, 0, 0],
    'five_up': ['赤冬', 0],
    'six_stars': ['能天使', '推进之王', '伊芙利特', '艾雅法拉', '安洁莉娜', '闪灵',
                  '夜莺', '星熊', '塞雷娅', '银灰', '斯卡蒂', '陈', '黑', '赫拉格', '麦哲伦',
                  '莫斯提马', '煌', '阿', '刻俄柏', '风笛', '傀影', '温蒂', '早露', '铃兰', '棘刺',
                  '森蚺', '史尔特尔', '瑕光', '泥岩', '山', '空弦', '嵯峨', '异客',
                  'W', 'W', 'W', 'W', 'W'],
    'five_stars': ['白面鸮', '凛冬', '德克萨斯', '芙兰卡', '拉普兰德', '幽灵鲨', '蓝毒',
                   '白金', '陨星', '天火', '梅尔', '赫默', '华法琳', '临光', '红', '雷蛇', '可颂',
                   '普罗旺斯', '守林人', '崖心', '初雪', '真理', '空', '狮竭', '食铁兽', '夜魔',
                   '诗怀雅', '格劳克斯', '星极', '送葬人', '槐琥', '苇草', '布洛卡', '灰喉', '吽',
                   '惊蛰', '慑砂', '巫恋', '极境', '石棉', '月禾', '莱恩哈特', '断崖', '蜜蜡', '贾维',
                   '安哲拉', '燧石', '四月', '奥斯塔', '絮雨', '卡夫卡', '爱丽丝', '乌有', '熔泉'],
    'four_stars': ['夜烟', '远山', '杰西卡', '流星', '白雪', '清道夫', '红豆', '杜宾',
                   '缠丸', '霜叶', '慕斯', '砾', '暗索', '末药', '调香师', '角峰', '蛇屠箱', '古米',
                   '深海色', '地灵', '阿消', '猎蜂', '格雷伊', '苏苏洛', '桃金娘', '红云', '梅',
                   '安比尔', '宴', '刻刀', '波登可', '卡达', '孑', '酸糖', '芳汀', '泡泡', '杰克',
                   '松果', '豆苗'],
    'three_stars': ['芬', '香草', '翎羽', '玫兰莎', '卡缇', '米格鲁', '克洛丝', '炎熔',
                    '芙蓉', '安赛尔', '史都华德', '梓兰', '空爆', '月见夜', '班点', '泡普卡'],
}
啊和森蚺卡池 = {
    'description': "'阿'和'森蚺'占六星出率的50%;\n" +
                   "'白面鸮'、'蓝毒'和'真理'占五星出率的50%",
    'six_up': ['阿', '森蚺', 0, 0],
    'five_up': ['白面鸮', '蓝毒', '真理', 0, 0, 0],
    'six_stars': ['能天使', '黑', '安洁莉娜', '银灰', '莫斯提马', '夜莺', '星熊', '陈',
                  '阿', '煌', '麦哲伦', '赫拉格', '斯卡蒂', '塞雷娅', '闪灵', '艾雅法拉', '伊芙利特',
                  '推进之王', '刻俄柏', '风笛', '傀影', '温蒂', '早露', '铃兰', '棘刺', '森蚺',
                  '史尔特尔', '瑕光', '泥岩', '山', '空弦', '嵯峨', '异客', '凯尔希'],
    'five_stars': ['狮蝎', '食铁兽', '蓝毒', '拉普兰德', '幽灵鲨', '德克萨斯', '槐琥',
                   '赫默', '红', '白面鸮', '空', '吽', '灰喉', '布洛卡', '苇草', '送葬人', '星极',
                   '格劳克斯', '诗怀雅', '夜魔', '真理', '初雪', '崖心', '守林人', '普罗旺斯', '可颂',
                   '雷蛇', '临光', '华法琳', '梅尔', '天火', '陨星', '白金', '芙兰卡', '凛冬', '惊蛰',
                   '慑砂', '巫恋', '极境', '石棉', '月禾', '莱恩哈特', '断崖', '蜜蜡', '贾维', '安哲拉',
                   '燧石', '四月', '奥斯塔', '絮雨', '卡夫卡', '爱丽丝', '乌有', '熔泉', '赤冬'],
    'four_stars': ['安比尔', '梅', '红云', '桃金娘', '苏苏洛', '格雷伊', '猎蜂', '阿消',
                   '地灵', '深海色', '古米', '蛇屠箱', '角峰', '调香师', '末药', '暗索', '砾', '慕斯',
                   '霜叶', '缠丸', '杜宾', '红豆', '清道夫', '白雪', '流星', '杰西卡', '远山', '夜烟',
                   '宴', '刻刀', '波登可', '卡达', '孑', '酸糖', '芳汀', '泡泡', '杰克', '松果', '豆苗'],
    'three_stars': ['芬', '炎熔', '月见夜', '香草', '史都华德', '卡缇', '米格鲁', '斑点',
                    '空爆', '梓兰', '芙蓉', '克洛丝', '玫兰莎', '翎羽', '泡普卡', '安赛尔'],
}
联合行动 = {
    'description': '特选干员定向寻访',
    'six_up': [0],
    'five_up': [0],
    'six_stars': ['夜莺', '温蒂', '铃兰', '棘刺'],
    'five_stars': ['芙兰卡', '赫默', '临光', '极境', '莱恩哈特', '安哲拉'],
    'four_stars': ['安比尔', '梅', '红云', '桃金娘', '苏苏洛', '格雷伊', '猎蜂', '阿消',
                   '地灵', '深海色', '古米', '蛇屠箱', '角峰', '调香师', '末药', '暗索', '砾', '慕斯',
                   '霜叶', '缠丸', '杜宾', '红豆', '清道夫', '白雪', '流星', '杰西卡', '远山', '夜烟',
                   '宴', '刻刀', '波登可', '卡达', '孑', '酸糖', '芳汀', '泡泡', '杰克', '松果', '豆苗'],
    'three_stars': ['芬', '炎熔', '月见夜', '香草', '史都华德', '卡缇', '米格鲁', '斑点',
                    '空爆', '梓兰', '芙蓉', '克洛丝', '玫兰莎', '翎羽', '泡普卡', '安赛尔'],
}
艾雅法拉和史尔特尔 = {
    'description': "'艾雅法拉'和'史尔特尔'占六星出率的50%;\n" +
                   "'凛冬'、'槐琥'和'华法琳'占五星出率的50%",
    'six_up': ['艾雅法拉', '史尔特尔', 0, 0],
    'five_up': ['凛冬', '槐琥', '华法琳', 0, 0, 0],
    'six_stars': ['能天使', '黑', '安洁莉娜', '银灰', '莫斯提马', '夜莺', '星熊', '陈',
                  '阿', '煌', '麦哲伦', '赫拉格', '斯卡蒂', '塞雷娅', '闪灵', '艾雅法拉', '伊芙利特',
                  '推进之王', '刻俄柏', '风笛', '傀影', '温蒂', '早露', '铃兰', '棘刺', '森蚺',
                  '史尔特尔', '瑕光', '泥岩', '山', '空弦', '嵯峨', '异客', '凯尔希'],
    'five_stars': ['狮蝎', '食铁兽', '蓝毒', '拉普兰德', '幽灵鲨', '德克萨斯', '槐琥',
                   '赫默', '红', '白面鸮', '空', '吽', '灰喉', '布洛卡', '苇草', '送葬人', '星极',
                   '格劳克斯', '诗怀雅', '夜魔', '真理', '初雪', '崖心', '守林人', '普罗旺斯', '可颂',
                   '雷蛇', '临光', '华法琳', '梅尔', '天火', '陨星', '白金', '芙兰卡', '凛冬', '惊蛰',
                   '慑砂', '巫恋', '极境', '石棉', '月禾', '莱恩哈特', '断崖', '蜜蜡', '贾维', '安哲拉',
                   '燧石', '四月', '奥斯塔', '絮雨', '卡夫卡', '爱丽丝', '乌有', '熔泉', '赤冬'],
    'four_stars': ['安比尔', '梅', '红云', '桃金娘', '苏苏洛', '格雷伊', '猎蜂', '阿消',
                   '地灵', '深海色', '古米', '蛇屠箱', '角峰', '调香师', '末药', '暗索', '砾', '慕斯',
                   '霜叶', '缠丸', '杜宾', '红豆', '清道夫', '白雪', '流星', '杰西卡', '远山', '夜烟',
                   '宴', '刻刀', '波登可', '卡达', '孑', '酸糖', '芳汀', '泡泡', '杰克', '松果', '豆苗'],
    'three_stars': ['芬', '炎熔', '月见夜', '香草', '史都华德', '卡缇', '米格鲁', '斑点',
                    '空爆', '梓兰', '芙蓉', '克洛丝', '玫兰莎', '翎羽', '泡普卡', '安赛尔'],
}

# 原神荒泷一斗卡池
一斗卡池up五星 = '荒泷一斗'
一斗卡池up四星 = ["久岐忍", "烟绯", "五郎"]
三星 = ["弹弓", '神射手之誓', '鸦羽弓', '讨龙英杰谭', '黑缨枪', '沐浴龙血的剑', '飞天御剑', '冷刃', '翡玉法球', '魔导绪论', '以理服人', '铁影阔剑',
      '黎明神剑']
常驻五星武器 = ["天空之刃", "天空之傲", "天空之翼", "天空之卷", "天空之脊", "狼的末路", "和璞鸢", "四风原典", "狼的末路", "阿莫斯之弓", "风鹰剑"]
常驻五星角色 = ["刻晴", "琴", "迪卢克", "莫娜", "迪卢克"]
常驻四星角色 = ['云堇', '托马', '早柚', '九条裟罗', '凝光', '菲谢尔', '班尼特', '丽莎', '行秋', '迪奥娜', '安柏', '重云', '雷泽', '芭芭拉',
          '罗莎莉亚', '香菱', '凯亚', '北斗', '诺艾尔', '砂糖', '辛焱']
常驻四星武器 = ["弓藏", '祭礼弓', '绝弦', '西风猎弓', '祭礼残章', '西风秘典', '匣里灭辰', '祭礼大剑', '西风大剑', '祭礼剑', '西风剑', '笛剑', '匣里龙吟',
          '钟剑',
          '雨裁', '西风长枪', '流浪乐章', '绝弦', '昭心']

# 原神-现代战争卡池
up_fw = "VOLT战机"
up_fow = ["NA45狙击枪", "女装JK", "弹簧刀二次元版"]
五星角色池_现代 = ["阿列克谢大叔", "谢菲尔德", "幽灵(西蒙莱利)", "坎巴拉飞行大师jeb", "大卫汉斯", "普瘦(普莱斯)"]
四星角色池_现代 = ["小强", "肥皂", "bill", "尤里", "范利肯"]
五星武器池_现代 = ["AMD-8导弹", "CNMD防御系统", "战斗飞斧", 'J-20/F-35战机', "A-10飞机", "X-5空对地导弹"]
四星武器池_现代 = ["M416突击步枪", "毒刺防空导弹", 'X-25突击步枪', 'AMR狙击枪', 'M4轻机枪']
三星卡池_现代 = ["m1911手枪", "jk用过的小刀", "板砖"]
tuple1 = (五星武器池_现代, 五星角色池_现代, 四星武器池_现代, 四星角色池_现代, 三星卡池_现代, up_fw, up_fow)
with open("原神_现代战争卡组.ys", "w") as f:
    js.dump(tuple1, f)